<h1 align=center><font size = 5>4 Exploratory Data Analysis with SQL</font></h1>

## Objective

Using this Python notebook we will understand the Spacex DataSet



##### Display the names of the unique launch sites  in the space mission

In [8]:
%sql select distinct Launch_Site from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]



##### Display 5 records where launch sites begin with the string 'CCA'

In [9]:
%%sql

select * 
from spacextbl
where Launch_Site like 'CCA%'
limit 5

 * sqlite:///my_data1.db
Done.

[('04-06-2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('08-12-2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22-05-2012', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('08-10-2012', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('01-03-2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]


##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%%sql 

select sum(PAYLOAD_MASS__KG_)
from spacextbl 
where customer = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]



##### Display average payload mass carried by booster version F9 v1.1

In [11]:
%%sql 

select Booster_Version, avg(PAYLOAD_MASS__KG_)
from spacextbl 
where Booster_Version = 'F9 v1.1'
group by Booster_Version

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 2928.4)]



##### List the date when the first succesful landing outcome in ground pad was acheived.

In [12]:
%sql select min(Date) from spacextbl

 * sqlite:///my_data1.db
Done.

[('01-03-2013',)]


##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [13]:
%%sql

select Booster_Version, Mission_Outcome, PAYLOAD_MASS__KG_
from spacextbl 
where Mission_Outcome = 'Success' 
and PAYLOAD_MASS__KG_ between 4000 and 6000

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 'Success', 4535),
 ('F9 v1.1 B1011', 'Success', 4428),
 ('F9 v1.1 B1014', 'Success', 4159),
 ('F9 v1.1 B1016', 'Success', 4707),
 ('F9 FT B1020', 'Success', 5271),
 ('F9 FT B1022', 'Success', 4696),
 ('F9 FT B1026', 'Success', 4600),
 ('F9 FT B1030', 'Success', 5600),
 ('F9 FT  B1021.2', 'Success', 5300),
 ('F9 FT B1032.1', 'Success', 5300),
 ('F9 B4 B1040.1', 'Success', 4990),
 ('F9 FT  B1031.2', 'Success', 5200),
 ('F9 FT  B1032.2', 'Success', 4230),
 ('F9 B4  B1040.2', 'Success', 5384),
 ('F9 B5 B1046.2', 'Success', 5800),
 ('F9 B5 B1047.2', 'Success', 5300),
 ('F9 B5 B1046.3', 'Success', 4000),
 ('F9 B5 B1048.3', 'Success', 4850),
 ('F9 B5 B1051.2 ', 'Success', 4200),
 ('F9 B5B1060.1', 'Success', 4311),
 ('F9 B5 B1058.2 ', 'Success', 5500),
 ('F9 B5B1062.1', 'Success', 4311)]


##### List the total number of successful and failure mission outcomes

In [17]:
%%sql

select Mission_Outcome, count('Mission_Outcome')
from spacextbl
group by Mission_Outcome
order by count('Mission_Outcome') desc

 * sqlite:///my_data1.db
Done.

[('Success', 98),
 ('Success (payload status unclear)', 1),
 ('Success ', 1),
 ('Failure (in flight)', 1)]


##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [44]:
%%sql 
select distinct Booster_Version, PAYLOAD_MASS__KG_ 
from spacextbl
where PAYLOAD_MASS__KG_ = (select max(PAYLOAD_MASS__KG_) from spacextbl)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

In [51]:
%%sql

select substr(Date, 4, 2) as month, 'Landing_Outcome', Booster_Version, Launch_Site, substr(Date,7,4) as year
from spacextbl
where substr(Date,7,4)='2015' 
or 'Landing_Outcome' = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('01', 'Landing_Outcome', 'F9 v1.1 B1012', 'CCAFS LC-40', '2015'),
 ('02', 'Landing_Outcome', 'F9 v1.1 B1013', 'CCAFS LC-40', '2015'),
 ('03', 'Landing_Outcome', 'F9 v1.1 B1014', 'CCAFS LC-40', '2015'),
 ('04', 'Landing_Outcome', 'F9 v1.1 B1015', 'CCAFS LC-40', '2015'),
 ('04', 'Landing_Outcome', 'F9 v1.1 B1016', 'CCAFS LC-40', '2015'),
 ('06', 'Landing_Outcome', 'F9 v1.1 B1018', 'CCAFS LC-40', '2015'),
 ('12', 'Landing_Outcome', 'F9 FT B1019', 'CCAFS LC-40', '2015')]



##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [66]:
%%sql 

select 'landing_outcomes', Mission_Outcome, Count('Mission_Outcome')
from spacextbl
where Date between '04-06-2010' and '20-03-2017'
and Mission_Outcome like 'Success%'
group by 'landing_outcomes', Mission_Outcome

 * sqlite:///my_data1.db
Done.

[('landing_outcomes', 'Success', 56),
 ('landing_outcomes', 'Success (payload status unclear)', 1)]